export const rule3 = {
    title: '三人掼蛋',
    sections: [
        {
            type: 'text',
            content: '本章着重介绍三人两副牌的一种掼蛋规则。'
        },
        {
            type: 'title',
            content: '发牌'
        },
        {
            type: 'text',
            content: '三人掼蛋使用**两副扑克牌**，去掉梅花 26 张和一张小王。进行洗牌打乱后，给每名玩家发放 27 张牌作为手牌。'
        },
        {
            type: 'title',
            content: '与四人掼蛋的区别'
        },
        {
            type: 'text',
            content: '绝大多数规则基本相同，参见四人掼蛋规则。有以下几点区别：'
        },
        {
            type: 'list',
            items: [
                '出牌和牌型规则同四人掼蛋。其中三张王即为王炸，王炸仍大过所有牌型，包括带上逢人配的七张或八张牌的炸弹',
                '三名玩家各自升级，上游升三级，中游升一级，末游不升级',
                '每轮打上一轮上游的玩家的级数，先打过A级的玩家胜',
                '进贡，抗贡和先出规则同四人掼蛋，其中下游摸两张大王即抗贡',
                '三次不过A级，则回到打2级',
            ]
        },
        {
            type: 'text',
            content: '三人掼蛋中，玩家的升级速度变快，同花和王炸的概率增加，牌局中同盟和敌人时常改变，而有玩家在打A级时又成为二打一，使得牌局更加刺激。'
        },
        {
            type: 'text',
            content: '三名玩家各自升级，上游升**三级**，中游升**一级**，末游不升级',
            isScoring: true,
            show: false
        }
    ]
}