export const rule9 = {
    title: '够级',
    sections: [
        {
            type: 'text',
            content: '够级使用四副扑克牌，由六人参加，游戏以尽早打完自己中所有的扑克牌为胜。其中，每不相邻的三个人组成一个“联邦”。'
        },      
        {
            type: 'text',
            content: '牌的大小顺序与牌型'
        },
        {
            type: 'text',
            content: '在够级游戏中，扑克牌的大小顺序是（由小到大）3、4、5、6、7、8、9、10、J、Q、K、A、2（通常称作“钱”）、小王、大王。除小王和大王外没有花色之分。'
        },  
        {
            type: 'text',
            content: '牌型为单张，或着多张同字的牌。没有顺子。'
        },      
        {
            type: 'text',
            content: '小王、大王可以代表其它各种牌， 称为“配牌”，俗称“代”或者“挂”。根据各地规则不同，2有时也可以配牌。出牌顺序一般为顺时针或逆时针依次出牌。玩家出牌后，下一个出牌的玩家必须与上一个玩家出相同牌型的牌，牌的点数必须大于上家。'
        },
        {
            type: 'text',
            content: '当一组牌中带有2时而不带大王或小王时，牌的大小取决于除2外其它牌的大小；当一组牌带有大王或小王时，牌的大小取决于所有的王以及里面副牌，例如，如果上家使用一张小王配三张6，下家必须使用1张大王配三张7或者以上。'
        },
        {   
            type: 'text',
            content: '两个大王配牌时相当于一张大于大王的牌。约称“大王二杀一”。'
        },
        {
            type: 'text',   
            content: '够级牌（级jī牌）：五个或以上10、四个或以上J、3个或以上Q、两个或以上K、两个或以上A、一个或以上2、一个或以上小王、一个或以上大王。代王的任何牌（挂王牌的）均为够级牌。部分规则中，为平衡大王的至高无上地位，被剔除够级牌行列，且无过牌。'
        },
        {
            type: 'text',   
            content: '开点牌：没有带2或王的够级牌（即五个或更多的10、四个或更多的J、3个或更多的Q、两个或更多的K、两个或更多的A），但各地区对于2是否可以替代的部分并不一致。'
        },

        {
            type: 'title',   
            content: '玩法特点'
        },
        {
            type: 'text',   
            content: '“进贡”：在开局发牌后，一些玩家要向另一些玩家赠送自己数量不等的最大的牌，此过程称为“进贡”。'
        },
        {
            type: 'text',   
            content: '“吃贡”：被进贡的玩家得到贡牌的过程。'
        },
        {
            type: 'text',   
            content: '“还贡”：进贡后，被进贡的玩家要从自己的牌中任意拿出与进贡牌数量相等的牌赠送给向自己进贡的玩家。被进贡的玩家得到进贡玩家允许后，可以拒绝吃贡。'
        },
        {
            type: 'text',   
            content: '贡牌：包括“清”，“烧”，“点”，“落（lá）”四种。山东地区常为“点烧闷落”，突出够级中的够级牌。'
        },
        {
            type: 'text',   
            content: '清贡，一般为一张，又称“憋贡”，“闷贡”，“憋三贡”，详见“憋三”。'
        },
        {
            type: 'text',   
            content: '烧贡，一般为一张，烧牌成功的玩家吃被烧的玩家。'
        },
        {
            type: 'text',   
            content: '点贡，如果对头玩家没有开点，则吃一张“点贡”。都没有开点时，可以互换“点贡”。'
        },
        {
            type: 'text',   
            content: '第一名走玩牌的玩家吃最后一名走玩牌的玩家两张落贡，称为“大落贡”，第二名走完牌的玩家吃倒数第二名走完牌的玩家一张落贡，称为“二落贡”。联邦内部可以互保不进贡，但需要在开局前应敌对联邦要求报出贡牌。'
        },
        {
            type: 'text',   
            content: '“憋三”：亦称“闷贡”。在够级游戏中，所有的3只能在最后一次出牌中出掉。如果在发牌结束后某位玩家的手中没有3，则他需要用自己的一张2向对家（座位与他相对的玩家）换取一张3，而没有2时则需用王买，称为“买三”；当对家没有多余3时，由联邦队友赠3。游戏过程中，若玩家甲在准备出3前的一套牌被玩家乙封盖，导致此玩家没有机会马上出手中的3，则称玩家甲被玩家乙“憋”了。在下一局发牌后，上一局被“憋三”的玩家向“憋”自己的玩家进一张“憋贡”。当一局牌有多名玩家被憋，则“先憋为落”，即第一名被憋的玩家为“大落”，后被憋的为“二落”。'
        },
        {
            type: 'text',   
            content: '“够级”与“开点”：'
        },
        {
            type: 'text',   
            content: '够级：在普通顺序出牌的基础下，若某一玩家下打出够级牌，则此时出牌权跳转到他的对头（座位与他相对的玩家），由此两家轮流出牌。'
        },  
        {
            type: 'text',   
            content: '开点发4：在规定4为开点牌的情况下，开点牌获胜的玩家应立刻在下一轮出牌时打出自己手中所有的4，然后完成“开点”，忘记发4或者没有4的玩家视仍为没有开点。未通过开点牌赢得发牌权出4，或当有其他玩家发3而随4的情况，皆视为“不开点”。4类似3可以买卖，但没有时不必须买。'
        },
        {
            type: 'text',   
            content: '沉4：见“4沉底”。'
        },
        {
            type: 'text',   
            content: '“烧牌”：没有过牌的情况下出牌打非对头玩家的够级牌，称为“烧牌”。打出后，如果烧牌者的对头无法压住，且烧牌者可以除3以外其他套牌都挂王打出不被挡住，则烧牌成功，反之，若烧牌者的对头压住任意一套，称为“解烧”，烧牌不成功。烧牌后无法除3外每套牌挂王，则判烧牌者大落。例如，玩家甲下出够级牌以后，非对家的玩家乙强行抢夺出牌权，烧牌。除烧牌的那套牌以外，玩家乙出的每一套牌必须配王。在玩家乙的出牌过程中，玩家乙的对家可以继续压制玩家乙，除玩家乙以外的玩家也可以继续烧牌。如果玩家乙出牌被压制，则为烧牌不成功，游戏继续。如果玩家乙在烧牌过程中被别的玩家烧牌，称为“反烧”，进烧贡翻番。如果玩家乙顺利走完牌，则为烧牌成功。这时，被烧牌的玩家需要在下一局发牌后向烧牌的玩家进一张“烧贡”。如果玩家乙有的牌不能配王，比如计算错误，基本牌数量大于王的数量，则为烧牌失败。此时，玩家乙结束此局游戏，自动成为最后一名“大落”。如果玩家没有开点（有4参与时由4决定，手中无4即可烧牌，“沉4”视为天生“烧得起”），则不允许烧牌。'
        },
        {
            type: 'text',   
            content: '步骤'
        },
        {
            type: 'text',   
            content: '发牌：随机，每人36张。'
        },
        {
            type: 'text',   
            content: '买四（如果需要的话）。'
        },
        {
            type: 'text',   
            content: '进贡（如果需要的话）。'
        },
        {
            type: 'text',   
            content: '此时，若有玩家手中既无大、小王，又无2，则此玩家可以宣布“革命”，此玩家不再参与本局比赛，且此玩家既未获胜，也未输掉本局比赛（此玩家为本局游戏的“三科”或“四科”）。若有两个以上的玩家同时宣布“革命”，则所有玩家重新洗牌、发牌，重新开始牌局，新牌局中不再进贡。'
        },
        {
            type: 'text',   
            content: '出牌。'
        },
        {
            type: 'text',   
            content: '结束本局游戏：'
        },
        {
            type: 'text',   
            content: '若只剩一个玩家没有打完手中的牌，则比赛结束。此时，按照打完手中的牌的先后顺序，六名玩家依次被称为“头科”、“二科”、“三科”、“四科”、“二落（lá）”、“大落（lá）”。下一局游戏中，上一局中的大落需要向头科进两张“落贡”，二落需要向二科进一张“落贡”。'
        },
        {
            type: 'text',   
            content: '开始下一局游戏。'
        },
        {
            type: 'text',   
            content: '术语'
        },
        {
            type: 'text',   
            content: '回手牌。假设玩家甲出牌，其打出三个5，同时甲在手中保留了三个A作为本次出牌的后备。若其余五人至少有一人为甲之前的三个5出牌，甲打出手中的后备牌三个A，则这三个A可称作甲在这一轮的回手牌。若其余人没人管甲的三个5，则甲准备的三个A不能称为回手牌。出牌时一般够级牌、2、王作为后备时才能称作回手牌。'
        },
        {
            type: 'text',   
            content: '圈。同“串三户”。当联邦分获一、二、三客时，免掉对方的所有贡，改为每人一张的“圈”贡。常为了避免“圈”掉，而会放掉对帮的一家为“三客”，从而保证“贡”。'
        },
        {
            type: 'text',   
            content: '进贡及其顺序'
        },
        {
            type: 'text',   
            content: '点贡。'
        },
        {
            type: 'text',   
            content: '烧贡。参见上文“烧牌”。但不同的地方烧牌略有不同。另一种规则是：烧牌的玩家乙必须保证每次打出的牌都至少包含一个王，否则不能烧牌。若乙尝试烧牌，则其之后打出的牌可由其对家打回（只能是对家，其它人不可打回），被打回后烧牌失败，继续下一轮出牌。如果烧牌时玩家乙已无对家，则任一家都可打回，即玩家乙被反烧。'
        },
        {
            type: 'text',   
            content: '闷（敬）贡。有些地方“憋三”又叫敬贡，叫法不同但内容一样。'
        },
        {
            type: 'text',   
            content: '落贡。'
        },
        {
            type: 'text',   
            content: '进贡顺序：进贡时按照敬、点、烧、闷、落的顺序依次进行。'
        },
        {
            type: 'text',   
            content: '革命：在抓完牌，并完成进贡、还贡过程之后，如果一个玩家手中既无王，也无2，则可以宣布“革命”（当然也可以不选择革命）。 所谓“革命”也就是不参与本局游戏。革命者在走科排序上一般视为四科（所以有人革命的情况下，仍可能串三户）。'
        },
        {
            type: 'text',   
            content: '革命者的开点。革命者在革命之后，也就与闷贡、烧贡无关了。而点贡取决于革命者是否能开点。一般规则中，革命者在革命时，将手牌中自认为最大的一组够级牌打出，如果被对头压倒，则革命者不开点；如果没被对头压倒，则革命者开点。'
        },
        {
            type: 'text',   
            content: '革命者对头的够死级/开点。革命者的对头，有三次够死级的机会。三次够死级之后，进入无头状态。其他玩家可以正常接打无头者的牌，无头者也可正常接打其他玩家的牌。如果三次够死级均是用的可开点的三组够级牌（而不是单2、王、贴王等情况），则无头者开点；若无头者没有能力打出三组够级牌，则无头者不开点。'
        },
        {
            type: 'text',   
            content: '革命特殊规则。一般规则中，是不允许两个（或两个以上）玩家革命的，否则本局作废。否则会导致提早进入四家乱打状态，影响开点。但个别地区规则允许两个玩家革命，这种情况下，会有两人（即两位革命者的对头）分别在三次够死级之后，进入无头状态。但不适用于通常四家乱打的规则，不然剩余四名玩家就无法开点了。由于两人革命本来就不是一般规则，所以规定也就比较灵活。通常是，在两人革命后，四人之中凡是有头的玩家仍可正常开点，直到有一人走科，进入“三家乱打”状态。'
        },
        {
            type: 'text',   
            content: '不同的规则'
        },
        {
            type: 'text',   
            content: '六3六4：请参见上文关于落三（最后下3）、闷四（开点后才能出4）的介绍。为了增加游戏的趣味性，有些地方故意只保留4副牌中的六个3和六个4，这样可以基本保证每一盘都有人买3和买4。'
        },
        {
            type: 'text',   
            content: '六3八4：由于四副扑克张数的原因，在六3六4的基础上外加2张4，从而让每位玩家手中牌的数量一致，每人33张。'
        },
        {
            type: 'text',   
            content: '4沉底：在六4或者八4的情况下，可以在进贡完成、开始出牌之前，把手中的4反扣发出。这是对“天降弱购机”的玩家的一种和谐，承认“点贡”却可以少一副4牌，从而有利于抢客。故有“弃点争头客”一说。'
        },
        {
            type: 'text',   
            content: '2不能用来挂牌：算是为了增加一点难度，有些地方2不能像王一样挂牌，只能当一般的牌来用。'
        },
        {
            type: 'text',   
            content: '宣点：在进完贡后，开始出牌前，若自己跟对头皆有4，且双方都没有革命时可宣告宣点，宣点之后若自己有开点而对头没有开点时，对头需额外进2张点贡，其他情况时自己需额外进2张贡。若双方互相宣点时则进贡牌数叠加计算。'
        },
        {
            type: 'text',   
            content: '直勾不开点：若在一轮开始时出够级牌，那么不能开点。只能在一轮已经在进行中，够级牌用来回应其余玩家的非够级牌，且对家不能做出有效回应时才能开点。'
        },
        {
            type: 'text',   
            content: '打点不开点：玩家甲打出够级牌试图开点，其对家乙用够级牌回应将甲的够级牌打回，且甲不在继续进行回应。由于乙的够级牌是用来打回对家的够级牌的，因此乙不能开点。'
        },
        {
            type: 'text',   
            content: '有敬（闷）无圈：在“憋三”打法时，如果玩家被“憋”，则，若对方联邦分别获得一、二、三客，也不算“圈”。此条为了可以最大程度履行“憋三”，而不至于为了避免“圈”而特意放走对帮一玩家为“三客”。'
        },
        {
            type: 'text',   
            content: '抗贡：一人抓到8个2或者4个大王就可以抗贡， 即不进贡。抗贡后一般同伙都不用进贡了，也有时只抗落贡。'
        },
        {
            type: 'text',   
            content: '明上：开局前联邦商议决定给对门明上，那进贡就翻番，当然出贡也翻番。后来还发明了“于上”之类翻更多番的，一般超过6人玩的时候才会出现。'
        },
        {
            type: 'text',   
            content: '无头：对门走了或革命了则自己就是无头了，无头一般在不过牌的情况下可以随便打别人的够级牌而不烧牌，无头出的够级牌，别人也都可以打而不算烧牌。'
        },
        {
            type: 'text',   
            content: '过牌：口头语叫“过牌不发”，即同一回合内上一轮若没出牌，算是过牌，这一轮就不能出了。但是对门是例外，如果本门发了勾几牌，只有对门能上，如果本门发的不是勾几牌，则出牌最后，对门还有一次出牌机会。'
        },
    ]
}